{"abstract_algebra": ["In the group G = {2, 4, 6, 8) under multiplication modulo 10, the identity element is", "Statement 1 | In a group (ab)^{-2} = b^{-2}a^{-2}. Statement 2 | In a group (ab)^n = a^nb^n.", "Find the characteristic of the ring Z x Z.", "Find the maximum possible order for an element of S_n for n = 6."], "anatomy": ["You notice a lesion on the labial alveolar mucosa of the lower right lateral incisor tooth of one of your patients and decide to take a biopsy to send for oral pathology report Which nerve would require local anaesthesia in order to carry out a pain-free biopsy?", "The major concentrations of proprioceptive receptors providing information about position of the TMJ are located in", "A patient suffers a CVA in the area of the left internal capsule conveying motor neurons to the right leg. The patient's leg will exhibit", "Laryngeal oedema is usually confined to the larynx above the vocal folds because"], "clinical_knowledge": ["The pyruvate dehydrogenase complex:", "What is the 'normal' range of flexion at the knee joint?", "The term gene doping refers to:", "Blood clots are responsible for repeatedly blocking a catheter. What should you do?", "Which of these is not necessary when examining the jugular venous pulse?", "As a general principle what is the best approach to the use of analgesic drugs following surgery?", "What is a tracheostomy?", "The genome is:", "Which of the following is true in a sensory assessment of the arm?"], "college_chemistry": ["The number of allowed energy levels for the 55Mn nuclide are:"], "college_mathematics": ["A university’s mathematics department has 10 professors and will offer 20 different courses next semester. Each professor will be assigned to teach exactly 2 of the courses, and each course will have exactly one professor assigned to teach it. If any professor can be assigned to teach any course, how many different complete assignments of the 10 professors to the 20 courses are possible?"], "college_medicine": ["In games like soccer the blood lactate concentration:", "Which of the following nucleotide bases is not found in RNA?", "The energy for all forms of muscle contraction is provided by:"], "college_physics": ["Two spaceships approach Earth with equal speeds, as measured by an observer on Earth, but from opposite directions. A meterstick on one spaceship is measured to be 60 cm long by an occupant of the other spaceship. What is the speed of each spaceship, as measured by the observer on Earth?", "Consider an electron in the n = 4, l = 1 state in hydrogen. Which of the following final states can NOT be reached by an allowed transition?", "A uniform solid disk starts from rest and rolls down an inclined plane without slipping. After some time, what fraction of the disk’s total kinetic energy is rotational kinetic energy?"], "conceptual_physics": ["Polarization is a property of", "Huygens’ principle for light is primarily described by"], "econometrics": ["Consider an identical situation to that of question 21, except that now a 2-sided alternative is used. What would now be the appropriate conclusion?"], "electrical_engineering": ["The main advantage of dielectric heating is that", "Four identical alternators each are rated for 20 MVA, 11 KV having a subtransient reactance of 16% are working in parallel. The short circuit level at the busbar is", "Which of the following is used in SCR to protect from high dV / dt?", "Relative error is same as", "Thin laminations are used in a machine in order to reduce"], "elementary_mathematics": ["Which number written in exponential notation is equivalent to 343?"], "global_facts": ["World Bank data show that in 1995, the poorest 20% of households accounted for 7.5% of household income in Niger, the next 20% of households accounted for 11.8% of income, the middle 20% accounted for 15.5% of income, the second richest 20% accounted for 21.1% of income, and the top 20% accounted for 44.1% of income. What was the cumulative income share of the bottom 60% of households in Niger?", "As of 2019, about what percentage of Italians say it is very important to have free media in our country without government/state censorship?", "Which of the following countries emitted the most CO2 in 2017?", "At the time of independence, there were already hundreds of thousands of university graduates in ____, but hardly any at all in ____."], "high_school_biology": ["In plants, the tendency of climbing vines to twine their tendrils around a trellis is called", "Microtubules are protein filaments assembled from tubulin protein subunits. The chemical colchicine prevents the assembly of microtubules by binding to tubulin protein subunits. Which of the following cellular processes would be most impaired by the application of colchicine?", "Which of the following statements is an inference of natural selection?", "When water evaporates from the surface of a pond, what happens to the remaining liquid water?", "Which of the following statements correctly describes what happens to the preRNA during RNA processing?", "A researcher grows a population of ferns in her laboratory. She notices, after a few generations, a new variant that has a distinct phenotype. When she tries to breed the original phenotype with the new one, no offspring are produced. When she breeds the new variants, however, offspring that look like the new variant result. What kind of speciation does this example illustrate?", "The Darwinian fitness of an individual is measured most directly by", "Two individuals, one with type B blood and one with type AB blood, have a child. The probability that the child has type O blood is", "Which of the following are characteristics of both bacteria and fungi?", "Which of the following is a frameshift mutation?", "Viruses are considered an exception to the cell theory because they"], "high_school_chemistry": ["Less than 1/1000 of the mass of any atom is contributed by", "Carbon exists in various forms called allotropes. Which of the following is not an allotrope of carbon?"], "high_school_computer_science": ["Let l = [1,2,3,4]. What is min(l) in Python3?", "A sorted list of numbers contains 500 elements. Which of the following is closest to the maximum number of list elements that will be examined when performing a binary search for a value in the list?"], "high_school_geography": ["Which one of the following is NOT a centripetal force in a state?", "The construction of freeways leads to all but which of the following results?"], "high_school_government_and_politics": ["In the House of Representatives, the Rules Committee", "When an appeal is made to the Supreme Court, the court usually", "Every ten years, the majority of state legislatures are responsible for", "Considered as a single group, the Small Business Administration, the Small Business committees in the House and Senate, and small business advocacy groups are an example of", "The line-item veto was ruled unconstitutional because it", "The majority of Supreme Court justices", "A presidential plurality victory occurs when", "Among the executive branch's checks on the legislative branch is the president's power to"], "high_school_macroeconomics": ["Which of the following events has no effect on GDP?", "If the demand for dollars rises while the supply of dollars falls then the", "Labor productivity and economic growth increase if", "If nominal GDP equals $5000 and real GDP equals $4000 then the GDP Deflator equals", "According to Keynesian analysis the Great Depression was caused by", "GDP is calculated for each by", "With a managed float", "If the demand for our exports rises while our tastes for foreign goods falls off then", "Which of the following is a tool used by the Fed to increase the money supply?", "The government has just lowered personal income taxes. Which of the following best describes the effects that this policy has on the economy?", "Stagflation is the result of", "Which of the following would reduce economic growth?", "If interest rates rise relatively more in country A than in country B then the value of country A's currency will", "For a given level of government spending the federal government usually experiences a budget____during economic____and a budget ______during economic_______.", "The natural rate of unemployment", "If firms that make a particular product expect its price will be lower in the future", "If the economy is in disequilibrium where the price level is such that the aggregate quantity of products demanded exceeds the aggregate quantity of products supplied then", "According to Classical economic theory the equation of exchange demonstrates the neutrality of money only if the", "To close a recessionary gap", "Fiat money", "Tariffs and quotas"], "high_school_mathematics": ["The shape of the sign outside Bob's Burger Barn is a regular octagon. How many degrees are in the measure of an interior angle of this sign?", "Find the sum of the primes between 100 and 200, inclusive, that are 1 or 2 more than a perfect square.", "The Fibonacci sequence is the sequence 1, 1, 2, 3, 5, $\\ldots$ where each term is the sum of the previous two terms. What is the remainder when the $100^{\\mathrm{th}}$ term of the sequence is divided by 4?", "(i + 1)(5 – 5i)(5 + 5i) =", "Five years ago, a computer that worked half as fast as a current computer cost twice as much money. The current computer's speed to price ratio is what percent of the older computer's speed to price ratio?", "Find the volume of the solid generated when the region bounded by the y-axis, y = e^x, and y = 2 is rotated around the y-axis.", "As the tides change, the water level in a bay varies sinusoidally. At high tide today at 8 A.M., the water level was 15 feet; at low tide, 6 hours later at 2 P.M., it was 3 feet. How fast, in feet per hour, was the water level dropping at noon today?", "Consider two positive even integers less than $15$ (not necessarily distinct). When the sum of these two numbers is added to their product, how many different possible values may result?", "Two numbers added together are 19. Their product is 70. What are the two numbers?"], "high_school_microeconomics": ["The law of increasing costs", "The supply curve for lawn-mowing services is likely to slope upward because of", "An effective price ceiling in the market for good X likely results in", "Which of the following is not correct about economies of scale?", "In the same period there is a drought affecting the supply of pineapples and a discovery that may assist in the avoidance of cancer. How will this combination of events affect the equilibrium price and quantity of pineapples?Equilibrium Quantity", "The United States is trading salmon to Peru in exchange for anchovies. If these nations are trading based upon relative opportunity costs, what must be the case?"]}