{"abstract_algebra": ["Find the generator for the finite field Z_11."], "anatomy": ["You notice a lesion on the labial alveolar mucosa of the lower right lateral incisor tooth of one of your patients and decide to take a biopsy to send for oral pathology report Which nerve would require local anaesthesia in order to carry out a pain-free biopsy?", "When an emergency opening into the airway is required, the cricothyroid membrane should be pierced immediately", "In the fetus, the ductus arteriosus passes blood from the", "Which of the following bones has a process that joins with the zygomatic bone to form the zygomatic arch?", "In men, specimens for gonococcal cultures are most commonly obtained from which of the following structures?"], "astronomy": ["A Mars year is approximately how many Earth years long?", "As the life of a star progresses heavy elements are produced. The elements form layers around the star in this order (starting from the outer layer):", "The belts and zones of Jupiter are", "Imagine that the Earth was instantly moved to an orbit three times further away from the Sun. How much longer would a year be?", "How do we think the \"hot Jupiters\" around other stars were formed?", "Besides large astronomical objects astrophysicists are also interested in small particles from space. Which one of these particles has the weakest interactions with other particles?"], "clinical_knowledge": ["Name three of the five main uses of the hand.", "How many chromosomes do all human somatic cells contain?", "The rate limiting enzyme of glycolysis is:", "What is a tracheostomy?", "Why should careful consideration be given to providing people aged over 65 with information sources that are internet based?"], "college_biology": ["Keystone species are thought to have profound effects on the structure and composition of ecological communities because they"], "college_computer_science": ["Which of the following statements about datagrams sent by a node in a network using IPv4 protocol is (are) true?\nI. Datagrams at the source must be the size of the smallest maximum transmission unit (MTU) of all the links on a path to the destination.\nII. Datagrams may be fragmented during routing.\nIII. Datagrams are reassembled only at the destination."], "college_mathematics": ["How many structurally distinct Abelian groups have order 72?"], "college_medicine": ["A young man working with a therapist on becoming more productive is expressing many of his desires throughout growing up and how he feels that it has affected him. Through discernment, the therapist states that he believes the young man’s development is stuck in a stage that reflects itself by his inability to keep his house clean. According to Freud’s theory of psychosexual development, what stage would this young man be fixated in?", "The rate limiting enzyme of glycolysis is:"], "college_physics": ["A rod measures 1.00 m in its rest system. How fast must an observer move parallel to the rod to measure its length to be 0.80 m?"], "computer_security": ["A session symmetric key between two parties is used"], "conceptual_physics": ["When wind speeds up as it blows over the top of a hill, atmospheric pressure there", "A galvanometer can be calibrated to read electric", "The fact that the Moon always shows its same face to Earth is evidence that the Moon rotates about its axis about once per", "Find the speed of a wave by multiplying its frequency by its", "If you change the magnetic field in a closed loop of wire, what is created in the loop is a(n)", "When an element ejects a beta particle, the atomic number of that element", "Compared with the sound you hear from the siren of a stationary fire engine, its sound when it approaches you has an increased", "The rotational inertia of an object is greater when most of the mass is located", "Boiling and freezing occur when water is subjected to"], "econometrics": ["Consider the following AR(2) process:\n\nyt = 1.5 yt-1 - 0.5 yt-2 + ut\n\nThis is a", "Which of the following estimation techniques are available for the estimation of over-identified systems of simultaneous equations?\n\ni) OLS\n\nii) ILS\n\niii) 2SLS\n\niv) IV", "Which of the following are characteristics of a stationary process?\n\ni) It crosses its mean value frequently\n\n\nii) It has constant mean and variance\n\n\niii) It contains no trend component\n\n\niv) It will be stationary in first difference form"], "electrical_engineering": ["To obtain a high value of capacitance, the permittivity of dielectric medium should be", "Under over voltage condition impedance offered by the voltage clamping device is"], "elementary_mathematics": ["A gas station sold 300.5849 gallons of gas in a day. How many gallons of gas did the gas station sell, rounded to the nearest hundredth?", "Find the value of the expression 14 + (−71).", "A teacher puts 5 packages of craft paper into a cabinet. Each package has 80 sheets of paper. What is the total numberof sheets of craft paper that the teacher puts into the cabinet?"], "formal_logic": [" Which of the given formulas of PL is the best symbolization of the following sentence?\nIf either George enrolls or Harry enrolls, then Ira does not enroll.", " Use indirect truth tables to determine whether each set of propositions is consistent. If the set is consistent, choose an option with a consistent valuation. (There may be other consistent valuations.)\n(E ⊃ F) ⊃ G\n(~E ∨ F) ≡ (H ∨ I)\nI ⊃ (J ⊃ ~H)\n~G ⊃ ~J", " Which of the given formulas of PL is the best symbolization of the following sentence?\nDoctors are helpful unless their patients are rude.", " Select the best translation into predicate logic: All first-year students take a swim test."], "global_facts": ["The conjecture that inequality first increases with development, then decreases with further development (known as the “inverted U hypothesis”) has, as of 2020, been", "As of 2015, the global fertility rate was about"], "high_school_biology": ["Recently, seasonal dead zones in low-oxygen waters have been occurring annually in the Gulf of Mexico near the mouth of the Mississippi River. The dead zones result from the rapid growth of photosynthetic phytoplankton (algal blooms) and their subsequent decay by oxygen-depleting microbes in the water column. Which of the following factors most likely triggers the algal blooms and the associated dead zones?", "Which of the following is most correct concerning cell differentiation in vertebrates?", "The frequency of a particular allele in a population of 1,000 birds in Hardy-Weinberg equilibrium is 0.3. If the population remains in equilibrium, what would be the expected frequency of that allele after 500 years?", "A feature of amino acids NOT found in carbohydrates is the presence of", "Which of these is the smallest unit that natural selection can change?", "Darwin's mechanism of natural selection required long time spans in order to modify species. From whom did Darwin get the concept of Earth's ancient age?"], "high_school_chemistry": ["Atoms of four elements are examined: carbon, nitrogen, neon, and sulfur. Which element would have a photoelectron spectra in which the peak representing electrons with the lowest ionization energy would be three times higher than all other peaks?", "A proposed mechanism for a reaction is as follows: NO2 + F2 →NO2F + F Slow step. F + NO2 → NO2F Fast step. What is the order of the overall reaction?", "A solution of sulfurous acid, H2SO3, is present in an aqueous solution. Which of the following represents the concentrations of three different ions in solution?", "Nitrous acid, HNO2, has a pKa value of 3.3. If a solution of nitrous acid is found to have a pH of 4.2, what can be said about the concentration of the conjugate acid/base pair found in solution?", "Which of the following best explains why the ionization of atoms can occur during photoelectron spectroscopy, even though ionization is not a thermodynamically favored process?", "Neutral atoms of chlorine are bombarded by high-energy photons, causing the ejection of electrons from the various filled subshells. Electrons originally from which subshell would have the highest velocity after being ejected?"], "high_school_european_history": ["This question refers to the following information.\nRead the excerpts below.\nThis corruption is repeatedly designated by Paul by the term sin . . . such as adultery, fornication, theft, hatred, murder, revellings, he terms, in the same way, the fruits of sin, though in various passages of Scripture . . . we are, merely on account of such corruption, deservedly condemned by God, to whom nothing is acceptable but righteousness, innocence, and purity.\n—John Calvin, from The Institutes of Christian Religion, Book 2: Chapter 1, 1545\nThe covenant of life is not preached equally to all, and among those to whom it is preached, does not always meet with the same reception. This diversity displays the unsearchable depth of the divine judgment, and is without doubt subordinate to God's purpose of eternal election. But if it is plainly owing to the mere pleasure of God that salvation is spontaneously offered to some, while others have no access to it, great and difficult questions immediately arise, questions which are inexplicable, when just views are not entertained concerning election and predestination[,] . . . the grace of God being illustrated by the contrast, viz., that he does not adopt all promiscuously to the hope of salvation, but gives to some what he denies to others.\n—John Calvin, from The Institutes of Christian Religion, Book 3: Chapter 21, 1545\nWhich of the following justifications used by Protestant reformers such as Calvin is alluded to above?", "This question refers to the following information.\nUnder the name of Chartist well-meaning inconsiderate men and other misled men have in very many cases, all over the country from the extreme west to the extreme east and from Brighton in the south to nearly the extreme north of Scotland, denounced every man who is not a working man, applied to him, the grossest epithets and most atrocious intentions and conduct, have threatened them with vengeance and in some places, have proposed plans for the seizure and division of their property—numbers of misled men and others of bad character, under the self-denomination of Chartists have gone from place to place and in the most violent manner disturbed and dispersed meetings of various kinds. Your Committee object to the words Household Suffrage since under any honest definition of the words—they would exclude a large majority of the men of these kingdoms—and because they have become reasonably obnoxious to the political portion of the working people.\n—Excerpt of a letter from British social reformer Francis Place, written in 1842\nWhich of the following is the political reaction led by Klemens von Metternich that occurred as a result of the Chartists, the French Revolution, and other liberal movements?", "This question refers to the following information.\nFrom this moment until that in which the enemy shall have been driven from the soil of the Republic, all Frenchmen are in permanent requisition for the service of the armies. The young men shall go to battle; the married men shall forge arms and transport provisions; the women shall make tents and clothing and shall serve in the hospitals; the children shall turn old linen into lint; the aged shall betake themselves to the public places in order to arouse the courage of the warriors and preach the hatred of kings and the unity of the Republic. …\nThe Committee of Public Safety is charged to take all necessary measures to set up without delay an extraordinary manufacture of arms of every sort which corresponds with the ardor and energy of the French people. It is, accordingly, authorized to form all the establishments, factories, workshops, and mills which shall be deemed necessary for the carrying on of these works, as well as to put in requisition, within the entire extent of the Republic, the artists and workingmen who can contribute to their success.\nThe representatives of the people sent out for the execution of the present law shall have the same authority in their respective districts, acting in concert with the Committee of Public Safety; they are invested with the unlimited powers assigned to the representatives of the people to the armies.\nThe Levée en Masse, August 23, 1793\nThe passage can be used as one example of the way in which the Committee of Public Safety"], "high_school_geography": ["Which structure(s) traditionally occupies the center of a historic Asian city?", "Which of the following items below is an absolute location?"], "high_school_macroeconomics": ["If households are more optimistic about the future how would the consumption function be affected?", "According to Classical economic analysis in the long run an increase in the money supply results in", "The size of the labor force in Japan is expected to shrink beginning in 2010 as a large segment of its population retires. This will", "Which of the following statements is true of production possibility curves and trade between nations?"], "high_school_mathematics": ["John is playing a game in which he tries to obtain the highest number possible. He must put the symbols +, $\\times$, and - (plus, times, and minus) in the following blanks, using each symbol exactly once:\\[2 \\underline{\\hphantom{8}} 4 \\underline{\\hphantom{8}} 6 \\underline{\\hphantom{8}} 8.\\] John cannot use parentheses or rearrange the numbers. What is the highest possible number that John could obtain?", "A number $x$ factors as $107\\cdot109^5$, and $107$ and $109$ are primes. What is the exponent of $109$ in the prime factorization of $x^{11}$?"], "high_school_microeconomics": ["A price discriminating monopoly differs from a non-discriminating monopoly because a discriminating monopoly", "Which of the following is a characteristic of monopolistic competition?", "Land refers to", "Assume a firm hires labor for $15 each and sells its products for $3 each. If the MP of the 3rd worker is 10, which of the following statements would be the most true?"], "high_school_physics": ["A stone is thrown vertically upward with an initial speed of 5 m/s. What is the velocity of the stone 3 seconds later?", "What happens to the image formed by a concave mirror as the object is moved from far away to near the focal point?", "A particle's kinetic energy is changing at a rate of –6.0 J/s when its speed is 3.0 m/s. What is the magnitude of the force on the particle at this moment?", "What happens to the pressure, P, of an ideal gas if the temperature is increased by a factor of 2 and the volume is increased by a factor of 8 ?", "A nonconducting sphere is given a nonzero net electric charge, +Q, and then brought close to a neutral conducting sphere of the same radius. Which of the following will be true?"]}